In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('Mall_Customers.csv')

In [4]:
data.head()

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                  15                      39
1           2    Male  21.0                  15                      81
2           3  Female  20.0                  16                       6
3           4  Female  23.0                  16                      77
4           5  Female  31.0                  17                      40

In [5]:
data.shape

(200, 5)

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     197 non-null    float64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 7.9+ KB

In [9]:
data.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

# checking datatypes

In [8]:
data.dtypes

CustomerID                  int64
Gender                     object
Age                       float64
Annual Income (k$)          int64
Spending Score (1-100)      int64
dtype: object

# checking null vaules

In [10]:
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       3
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

# checking duplicates

In [16]:
data.duplicated().sum()

0

# we can also drop null values

In [19]:
# syntax
# data=data.dropna(inplace=True)

# Dealing with null values

In [17]:
data['Age']=data['Age'].fillna(data['Age'].mean())

# again checking null values

In [18]:
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [20]:
data

     CustomerID  Gender        Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.000000                  15                      39
1             2    Male  21.000000                  15                      81
2             3  Female  20.000000                  16                       6
3             4  Female  23.000000                  16                      77
4             5  Female  31.000000                  17                      40
..          ...     ...        ...                 ...                     ...
195         196  Female  35.000000                 120                      79
196         197  Female  45.000000                 126                      28
197         198    Male  32.000000                 126                      74
198         199    Male  32.000000                 137                      18
199         200    Male  38.852792                 137                      83

[200 rows x 5 columns]